Revit 2016 API
AreaLoad.RefPoint Property
Retrieve the physical location of the reference point.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
Syntax
C#
[ObsoleteAttribute("This property is obsolete in Revit 2016. Use GetRefPoint() method instead.")]
public XYZ this[
	int index
] { get; }
Visual Basic
<ObsoleteAttribute("This property is obsolete in Revit 2016. Use GetRefPoint() method instead.")> _
Public ReadOnly Property RefPoint ( _
	index As Integer _
) As XYZ
	Get
Visual C++
[ObsoleteAttribute(L"This property is obsolete in Revit 2016. Use GetRefPoint() method instead.")]
public:
property XYZ^ RefPoint[int index] {
	XYZ^ get (int index);
}
Parameters
index
Type: System.Int32
The index of the point to return.
Remarks
The index should be between 0 and less than NumRefPoints.
See Also
AreaLoad Class
Autodesk.Revit.DB.Structure Namespace